#ifndef CDIMMKEYTABLE_H_
#define CDIMMKEYTABLE_H_

class CDimmKeyTable {
public:
    CDimmKeyTable()
    {
        field_14 = 0;
        field_18 = 0;
        field_0 = 0;
        field_4 = 0;
        field_8 = 0;
        field_C = 0;
        field_10 = 0;
        field_1C = 0;
        field_20 = 0;
    }

    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
    /* 0010 */ int field_10;
    /* 0014 */ int field_14;
    /* 0018 */ int field_18;
    /* 001C */ int field_1C;
    /* 0020 */ int field_20;
};

#endif /* CDIMMKEYTABLE_H_ */
